src/Catalogs/ВерсииТехнологическойПлатформы/ВерсииТехнологическойПлатформы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииТехнологическойПлатформы</name>
  <attributes>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>URLИнфо</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/ВерсииТехнологическойПлатформы/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьЭлемент(Версия) Экспорт
	
	Ссылка = НайтиЭлемент(Версия);
	Если Ссылка.Пустая() Тогда
		Ссылка = СоздатьЭлемент(Версия);
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

Функция НайтиЭлемент(Версия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсииТехнологическойПлатформы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВерсииТехнологическойПлатформы КАК ВерсииТехнологическойПлатформы
		|ГДЕ
		|	ВерсииТехнологическойПлатформы.Наименование = &Версия
		|	И НЕ ВерсииТехнологическойПлатформы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Версия", Версия);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.ВерсииТехнологическойПлатформы.ПустаяСсылка();
	
КонецФункции

Функция СоздатьЭлемент(Версия, URLИнфо = "", ДатаВыхода = Неопределено) Экспорт
	
	Если ДатаВыхода = Неопределено Тогда
		ДатаВыхода = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Объект = Справочники.ВерсииТехнологическойПлатформы.СоздатьЭлемент();
	Объект.Наименование = Версия;
	Объект.ДатаВыхода = ДатаВыхода;
	Объект.URLИнфо = URLИнфо;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции


Функция Актуальная() Экспорт
	
	ЗначениеВозврата = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВерсииТехнологическойПлатформы.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ВерсииТехнологическойПлатформы КАК ВерсииТехнологическойПлатформы
		|ГДЕ
		|	НЕ ВерсииТехнологическойПлатформы.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВерсииТехнологическойПлатформы.ДатаВыхода УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Наименование;
	КонецЕсли;
	
	Возврат ЗначениеВозврата;
	
КонецФункции

Функция НомерАктуальной() Экспорт
	
	Версия = Актуальная();
	Возврат Версия;
	
КонецФункции

#КонецОбласти
